app/views/pages/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
	if not $unauth
		$name = User.where(id: request.session["user_id"]).first.name