app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "google_oauth2"], ["uid", "106587199053696122244"], ["name", "Caleb Sullivan"], ["created_at", "2015-01-28 19:06:30.326684"], ["updated_at", "2015-01-28 19:06:30.326684"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "google_oauth2"], ["uid", "106587199053696122244"]]